/*
    1. รับค่าไว้ที่ตัวแปร n
    2. กำหนด i=1 ถ้า (i <= n) ให้ทำงานซ้ำ; ถ้าไม่ i เพิ่มขึ้นทีละ 1
        1. กำหนด ่ j=1 ถ้า (j <= n) ให้ทำำงานซ้ำ; ถ้าไม่ j เพิ่มขึ้นทีละ 1
            1. ถ้า i==1 หรือ j==1 หรือ i==n หรือ j==n ให้ แสดงผล*;
            2. ถ้าไม่ตรงเงื่อนไข แสดงผล " " 
        2. แสดงผลขึ้นบรรทัดใหม่
*/  

#include <stdio.h>

int main(){
    int n;
    scanf("%d", &n);
    for(int i=1; i<=n; i++){
        for(int j=1; j<=n; j++){
            if(i==1 || j==1 || i==n || j==n)
                printf("*");
            else
                printf(" ");
        }
        printf("\n");
    }
    return 0;
}