/*
แสดงผลการแยกตัวประกอบของตัวเลข

1. สร้างตัวแปร p เก็บเลข 2
2. แสดงผล "ให้ใส่ตัวเลข"
3. รับค่าเก็บในตัวแปร n
4. แสดงผลว่าจะได้ผลลัพธ์อะไรบ้าง 
5. ทำงานซ้ำ เมื่อ n<0
    1. ทำงานซ้ำเมื่อ n หาร p ลงตัว
        1. ถ้า (n/p เท่ากับ 1) ถ้าใช่ให้ปริ้นค่า p;
        2. ถ้าไม่ใช่ ให้ปริ้นค่า p และมีตัวคูณ(x);
        3. ให้ n มีค่าเท่ากับ n/p
    2. ให้ p มีค่าเพิ่มขึ้น 1
*/

#include <stdio.h>

int main(){
    int n;
    int p = 2;
    printf("Enter number : ");
    scanf("%d", &n);
    printf("Factoring Result : ");
    while(n>0){
        while(n%p == 0){
            if(n/p == 1)
                printf("%d", p);
            else
                printf("%dx", p);
            n = n/p;
        }
        p++;
    }
    return 0;
}